start_text1 = """Добро пожаловать.
"""
not_valid_text = """В данный момент бот воспринимает только ники через @. Пожалуйста, напишите ссылку в таком формате"""
help_text = """Как добавить чат:\n1. Перешлите сообщение из нужного чата\n2. Введите usename чата через @\n3. Ссылка на чат\n\nКак отписаться от канала:\n1. Повторно отправьте любой идендификатор чата!\n\nЕсть вопросы, пише /report."""
add_channel_instruction = """Инструкция как добавить канал"""
remove_channel_instruction = """Инструкция как удалить канал"""
private_channel = (
    """Это частный канал.\nЧтобы добавить этот канал, нужна ссылка-приглашение."""
)

channel_added = """добавлен. Следующая публикация этого канала появится в ленте"""
channel_added_yet = """уже добавлен. Чтобы удалить канал воспользуйтесь командой /list"""
сhannel_deleted = (
    """удален. Вы больше не будете видеть публикации этого канала в ленте"""
)
group_add = """Пожалуйста, для добавления группы напишите ник через @ или ссылку."""
mistake = """Нужный канал не найден. Пожалуйста, проверьте что вы поставили @ в названии и не опечатались"""
mistake_link = """Нужный канал не найден. Пожалуйста, проверьте корректность ссылки"""
find_text = "Выберите, что вы хотите найти"
find_single = "Пожалуйста, отправьте ссылку на канал через @. Поиск доступен только по публичным каналам"
find_global_low = (
    "У вас в подписках меньше 10 каналов, мы не можем искать по нашей базе"
)
find_global = "Результат анализа"
